app/controllers/cities_controller.rb

	def create
		@county = Country.find(params[:country_id])
		@city = @county.cities.create(city_params)
---
INSERT INTO "cities" ("city_info", "city_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city_info", "123"], ["city_name", "123"], ["created_at", Tue, 29 Sep 2015 12:17:54 UTC +00:00], ["updated_at", Tue, 29 Sep 2015 12:17:54 UTC +00:00]]